# Print Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
View..::..Print Method
View Class See Also
---
Print this view with the default view template and using the print setting of the current active document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void Print()
```

Visual Basic
---
```text
Public Sub Print
```

Visual C++
---
```text
public:
void Print()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the view cannot be printed. |

# See Also
View Class
Print Overload
Autodesk.Revit.DB Namespace